{
    "tag_name": "1.8-beta.8",
    "html_url": "https://github.com/emo44/easypy-desktop/releases/tag/1.8-beta.8",
    "body": "## 🐛 Bug Fixes & Polishing\n\n### 🖼️ [Fix] Image Aspect Ratio Consistency\n**Issue:** Images with *Keep Aspect Ratio* enabled often looked different in the Editor compared to the compiled EXE (F5/F9), especially when resizing or stretching the container.\n**Fix:** Unified the scaling logic between `DraggableImage` (Editor) and `AutoResizingLabel` (Runtime).\n* Images now align to the **center** automatically in both modes.\n* The \"Keep Aspect Ratio\" setting is now strictly respected in the generated code, matching the canvas visualization perfectly.\n\n---\n\n## 🛡️ New Safety Features\n\n### 🐍 [New] Pre-Run Syntax Checker\n\nBefore running a preview (F5) or compiling (F9), the engine now proactively scans all user scripts using Python's **AST (Abstract Syntax Tree)**.\n* **Detection:** Finds syntax errors (indentation issues, invalid syntax, missing colons) *immediately* before execution.\n* **Feedback:** Displays a clean alert pointing to the specific **Page** and **Widget ID** containing the error, allowing you to fix it without waiting for the app to launch and crash.\n\n### ⚠️ [Enhancement] Non-Interactive Widget Protection\n**Smart Code Generation:**\n* **Previously:** Attaching a script to a widget that doesn't support clicks could cause a crash or silent failure.\n* **Now:** The engine wraps signal connections in a safety block. If a widget doesn't support the default event (e.g., `clicked`), it safely skips the connection and prints a descriptive warning to the **Debug Console**.\n\n---\n\n## ✨ Core Enhancements\n\n### 🌐 [Feature] Bidirectional WebView Bridge\n**Seamless communication between the embedded browser and Python.**\n*   **Python ➡️ JS:** Execute JavaScript directly from your Python logic to update web content dynamically.\n*   **JS ➡️ Python:** Trigger Python functions and pass data from the WebView using the new event bridge.\n*   **Usage:** Perfect for integrating modern web frameworks (React, Vue) or interactive maps directly with your desktop application logic.\n\n### 🔌 [Feature] Native WebSocket Client\n**Real-time bidirectional communication made easy.**\n*   **Instant Data:** Connect to `ws://` or `wss://` servers to send and receive messages instantly.\n*   **Smart Integration:** Automatically triggers your Python scripts when a message arrives. Includes an **Auto-Connect** property.\n*   **Native Support:** Fully integrated into the compilation engine—no extra plugins required for the EXE.\n*   **Usage:** Ideal for chat applications, live financial dashboards, IoT control, and multiplayer games."
}
